# ============ 新增：全校各专业配置（2024级培养方案）============
# 以下代码添加到 MajorConfig.__init__ 的 self.majors 字典中

            # ------------------- 24环境工程 -------------------
            '24hjgc': {
                '专业名称': '24环境工程',
                '专业代码': '24hjgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['地下水动力学▲', '工程动力地质作用实验●', '地基基础与灾害防治●', '环境地质灾害数值模拟●', '国际课程-污染控制与治理', '国际课程-地质灾害防控'],
                    '工作技能课程': ['工程训练I', '科研训练']
                }
            },

            # ------------------- 24环境科学 -------------------
            '24hjkx': {
                '专业名称': '24环境科学',
                '专业代码': '24hjkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 10.0,
                    '专业知识课程': 10.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['环境法与环境经济学概论', '环境分析化学', '气候行动与碳中和原理', '普通生物学', '复变函数●', 'FORTRAN程序设计●', '数值计算方法●', '数学物理方法●', '环境', '海水分析▲'],
                    '专业知识课程': ['生态环境大数据与人工智能', '海洋环境调查与数据分析', '环境系统分析', '海洋生物地球化学导论', '空气污染气象学●', '物理海洋学●', '上层海洋-低层大气生物地球化', '近海环境预测技术理论●', '环境纳米材料▲', '生物海洋学▲'],
                    '工作技能课程': ['生物']
                }
            },

            # ------------------- 24会计学(ACCA) -------------------
            '24kuaijiACCA': {
                '专业名称': '24会计学(ACCA)',
                '专业代码': '24kuaijiACCA',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 12.0
                },
                '选修课列表': {
                    '学科基础课程': ['经济学（微观部分）', '管理学原理', '经济学（宏观部分）', '公司法与商法F4', '商业伦理与可持续发展', '统计学', '管理信息系统', '金融学', '跨国公司管理控制'],
                    '专业知识课程': ['税收筹划'],
                    '工作技能课程': ['政府审计', '高级业绩管理P3', '企业经营模拟', '高级财务管理P4', '创新研究项目', '创业实践策划']
                }
            },

            # ------------------- 24会计学 -------------------
            '24kuaiji': {
                '专业名称': '24会计学',
                '专业代码': '24kuaiji',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 11.0
                },
                '选修课列表': {
                    '学科基础课程': ['跨国公司管理控制'],
                    '专业知识课程': [],
                    '工作技能课程': ['公共关系和社交礼仪', '企业经营模拟', '创新研究项目', '创业实践策划', '内部控制与智能风险评估', '成本管理控制', '营运资金管理', '资本运营实务']
                }
            },

            # ------------------- 24工商管理 -------------------
            '24gsgl': {
                '专业名称': '24工商管理',
                '专业代码': '24gsgl',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.5,
                    '专业知识课程': 11.0,
                    '工作技能课程': 5.0
                },
                '选修课列表': {
                    '学科基础课程': ['企业策划', '工商管理跨学科前沿', '运筹学'],
                    '专业知识课程': ['投资管理', '数智商业模式创新', '企业数字化战略与创新', '工商管理学科前沿', '公司治理'],
                    '工作技能课程': ['企业经营模拟', '机器人商业企划与创新实践']
                }
            },

            # ------------------- 24市场营销 -------------------
            '24scyx': {
                '专业名称': '24市场营销',
                '专业代码': '24scyx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 8.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': ['会计学（共享）', '财务管理（共享）', '人力资源管理（共享）'],
                    '专业知识课程': ['电子商务平台运营管理', '乡村产业振兴与电商专题'],
                    '工作技能课程': ['企业经营模拟', '机器人商业企划与创新实践', '创新创业实践', '会计财务案例分析大赛', '旅游实践创新能力训练', '△数据科学概论', '△数字经济与数字管理概论', '△营销决策模型', '△数智消费专题', '△人工智能前沿方法与应用', '△数智营销前沿专题']
                }
            },

            # ------------------- 24旅游管理 -------------------
            '24lygl': {
                '专业名称': '24旅游管理',
                '专业代码': '24lygl',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.0,
                    '专业知识课程': 13.0,
                    '工作技能课程': 7.0
                },
                '选修课列表': {
                    '学科基础课程': ['人力资源管理', '财务管理'],
                    '专业知识课程': ['文化创意与旅游策划', '新媒体平台策划与运营', '海洋旅游学', '健康旅游', '旅游大数据与智慧旅游', '旅游创新思维训练与学术素养', '生态旅游'],
                    '工作技能课程': ['旅游空间可视化技术与应用', '旅游实践创新能力训练', '专业社会实践导论']
                }
            },

            # ------------------- 24财务管理 -------------------
            '24cwgl': {
                '专业名称': '24财务管理',
                '专业代码': '24cwgl',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': ['跨国公司管理控制'],
                    '专业知识课程': ['高级财务会计', '会计信息系统', '财务管理咨询'],
                    '工作技能课程': ['营运资金管理', '企业经营模拟', '创新研究项目', '创业实践策划']
                }
            },

            # ------------------- 24国际经济与贸易 -------------------
            '24gjmy': {
                '专业名称': '24国际经济与贸易',
                '专业代码': '24gjmy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 10.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['产业经济学', '中级微观经济学', '中级宏观经济学', '会计学'],
                    '专业知识课程': ['港口经济与管理', '国际服务贸易', '世界经济贸易组织', '国际经济与贸易学科前沿', '博弈论导论', '财政学'],
                    '工作技能课程': ['进出口业务模拟实验', '国际经贸专业英语（外教）']
                }
            },

            # ------------------- 24物流管理 -------------------
            '24wlgl': {
                '专业名称': '24物流管理',
                '专业代码': '24wlgl',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 12.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': ['国际贸易实务', '金融学', '国际金融学（双语）'],
                    '专业知识课程': ['国际贸易运输与保险', '国际经济合作', '博弈论与信息经济学', '国际结算（双语)', '物流规制'],
                    '工作技能课程': ['物流公司实习', '物流专业外语（外教）', '物流经典文献选读']
                }
            },

            # ------------------- 24经济学(海洋经济) -------------------
            '24jjx': {
                '专业名称': '24经济学(海洋经济)',
                '专业代码': '24jjx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 9.0,
                    '专业知识课程': 11.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['数理经济学', '发展经济学', '经济思想史', '制度经济学', '英语口语Ⅰ（外教）', '英语口语Ⅱ（外教）'],
                    '专业知识课程': ['海洋旅游经济学', '博弈论与信息经济学', '会计学', '财务管理', '面板数据分析及stata应用', '数字经济学'],
                    '工作技能课程': ['海洋经济认知实习', '海洋经济专题讲座']
                }
            },

            # ------------------- 24金融学(CFA) -------------------
            '24jrxCFA': {
                '专业名称': '24金融学(CFA)',
                '专业代码': '24jrxCFA',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 12.0,
                    '专业知识课程': 16.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': ['海洋经济学概论', '中级财务管理', '职业道德与伦理（双语）', '国际贸易理论与实务(双语）', '金融法'],
                    '专业知识课程': ['投资组合管理（双语）', '金融时间序列分析', '另类投资（双语）', '中国金融史', '国际结算（双语）', '信托与租赁', '行为金融学（双语）', '涉海金融'],
                    '工作技能课程': ['外汇业务实操（实验）', '期货暨衍生品理论与实务', '人工智能量化投资（实验）', '学术英语写作（双语）']
                }
            },

            # ------------------- 24金融学 -------------------
            '24jrx': {
                '专业名称': '24金融学',
                '专业代码': '24jrx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 12.0,
                    '专业知识课程': 16.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': ['海洋经济学概论', '中级财务管理', '职业道德与伦理（双语）', '国际贸易理论与实务(双语）', '金融法'],
                    '专业知识课程': ['投资组合管理（双语）', '金融时间序列分析', '另类投资（双语）', '中国金融史', '国际结算（双语）', '信托与租赁', '行为金融学（双语）', '涉海金融'],
                    '工作技能课程': ['外汇业务实操（实验）', '期货暨衍生品理论与实务', '人工智能量化投资（实验）', '学术英语写作（双语）']
                }
            },

            # ------------------- 24德语 -------------------
            '24dey': {
                '专业名称': '24德语',
                '专业代码': '24dey',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 8.0,
                    '工作技能课程': 5.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['德语语言学专题研讨课I', '德语语言学专题研讨课II', '德汉笔译'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24日语 -------------------
            '24ry': {
                '专业名称': '24日语',
                '专业代码': '24ry',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 4.5
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['中日文化交流史', '中日语言对比分析'],
                    '工作技能课程': ['学科前沿讲座']
                }
            },

            # ------------------- 24朝鲜语 -------------------
            '24cxy': {
                '专业名称': '24朝鲜语',
                '专业代码': '24cxy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 8.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['中韩文学关系史', '韩国语语法', '韩语语言学', '中韩语言对比', '韩国社会与语言', '语料库理论与技术', '韩中翻译理论与实践', '中韩翻译理论与实践', '韩汉口译', '朝鲜半岛历史', '东北亚国际关系', '电影与韩国文化', '韩国社会与文化'],
                    '工作技能课程': ['中韩经贸交流实习']
                }
            },

            # ------------------- 24法语 -------------------
            '24fy': {
                '专业名称': '24法语',
                '专业代码': '24fy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 6.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['经济法语II', '法语语言学概论'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24英语 -------------------
            '24yy': {
                '专业名称': '24英语',
                '专业代码': '24yy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 12.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24新闻学 -------------------
            '24xwx': {
                '专业名称': '24新闻学',
                '专业代码': '24xwx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 8.0,
                    '专业知识课程': 26.0,
                    '工作技能课程': 8.0
                },
                '选修课列表': {
                    '学科基础课程': ['现代经济学', '社会学', '中国文化史', '政治学'],
                    '专业知识课程': ['影视艺术', '纪录片创作', '媒介经营与管理', '社会科学研究方法', '电视文艺学', '传播与社会记忆', '数据新闻与可视化'],
                    '工作技能课程': ['广播电视新闻实务', '新闻漫画', '校园媒体实践', '广告设计与制作']
                }
            },

            # ------------------- 24汉语言文学 -------------------
            '24hywx': {
                '专业名称': '24汉语言文学',
                '专业代码': '24hywx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 28.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': ['古文字智能处理与视觉创意', '专业文献检索', '学术前沿讲座', '影视剧本创作']
                }
            },

            # ------------------- 24网络与新媒体 -------------------
            '24wlxmt': {
                '专业名称': '24网络与新媒体',
                '专业代码': '24wlxmt',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 8.0,
                    '专业知识课程': 15.0,
                    '工作技能课程': 7.0
                },
                '选修课列表': {
                    '学科基础课程': ['社会学', '中国文化史', '政治学'],
                    '专业知识课程': ['影视艺术', '数字出版学', '社会科学研究方法', '媒介经营与管理', '电视文艺学', '传播与社会记忆', '网络舆情分析与引导'],
                    '工作技能课程': ['广播电视新闻实务', '视频制作', '校园媒体实践', '广告设计与制作']
                }
            },

            # ------------------- 24法学(中外合作) -------------------
            '24fxzw': {
                '专业名称': '24法学(中外合作)',
                '专业代码': '24fxzw',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['美国娱乐法◆', '国际环境法◆', '美国法律职业生涯规划◆', '法学专项研究◆'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24法学 -------------------
            '24fx': {
                '专业名称': '24法学',
                '专业代码': '24fx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 16.0,
                    '工作技能课程': 8.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['自然资源法', '国际环境法学', '强制执行法', '外国刑法学', '金融法学', '地方法治前沿', '国际经济法前沿', '网络犯罪与刑法前沿'],
                    '工作技能课程': ['刑事诊所教学', '民事诊所教学', '国际法诊所教学', '环境诊所教学', '行政诊所教学', '仲裁与公证', '证据学', '经典研读报告', '法科资源检索与利用']
                }
            },

            # ------------------- 24公共事业管理 -------------------
            '24ggsy': {
                '专业名称': '24公共事业管理',
                '专业代码': '24ggsy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 20.0,
                    '工作技能课程': 0.5
                },
                '选修课列表': {
                    '学科基础课程': ['公共关系学', '中外经典著作选读'],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24政治学与行政学 -------------------
            '24zzx': {
                '专业名称': '24政治学与行政学',
                '专业代码': '24zzx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 8.0,
                    '专业知识课程': 14.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['大国政治', '政治学经典著作选读'],
                    '专业知识课程': ['外交学概论', '国际关系与国际法', '政治学前沿讲座'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24行政管理 -------------------
            '24xzgl': {
                '专业名称': '24行政管理',
                '专业代码': '24xzgl',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 8.0,
                    '专业知识课程': 10.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': ['公共关系学', '中外经典著作选读'],
                    '专业知识课程': ['环境政策与管理'],
                    '工作技能课程': ['行政能力测评与申论', '专题讲座']
                }
            },

            # ------------------- 24信息与计算科学 -------------------
            '24xxjskx': {
                '专业名称': '24信息与计算科学',
                '专业代码': '24xxjskx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 15.0,
                    '工作技能课程': 5.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['数据挖掘', '生物信息学', '机器学习与海洋数据分析', '有限差分方法', '常微分方程/稳定性理论', '偏微分方程近代理论', '代数基础', '高等数理统计', '统计计算', '一般拓扑学', '计算复杂性理论', '现代复分析导引', '海洋科学初探', '大气科学导论', '数学与海洋', '宏观经济学', '地球科学概论', '流体力学', '流体力学实验', '数学前沿选讲I', '数学前沿选讲II', '微观经济学'],
                    '工作技能课程': ['数学建模实践', '数值方法实践', '统计软件']
                }
            },

            # ------------------- 24数学与应用数学 -------------------
            '24sx': {
                '专业名称': '24数学与应用数学',
                '专业代码': '24sx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 15.0,
                    '工作技能课程': 5.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['生物信息学', '有限差分方法', '常微分方程/稳定性理论', '偏微分方程近代理论', '代数基础', '高等数理统计', '统计计算', '一般拓扑学', '计算复杂性理论', '现代复分析导引', '海洋科学初探', '大气科学导论', '数学与海洋', '宏观经济学', '地球科学概论', '流体力学', '流体力学实验', '数学前沿选讲I', '数学前沿选讲II', '微观经济学'],
                    '工作技能课程': ['数学建模实践', '数值方法实践', '统计软件']
                }
            },

            # ------------------- 24新能源材料与器件 -------------------
            '24xny': {
                '专业名称': '24新能源材料与器件',
                '专业代码': '24xny',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 8.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': ['材料科学与工程导论', '工程制图', '材料科学基础', '电化学基础', '电工电子学', '固体化学', '纳米材料概论', '计算机在材料科学中的应用技术', '新型碳材料'],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24材料科学与工程 -------------------
            '24clkx': {
                '专业名称': '24材料科学与工程',
                '专业代码': '24clkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 14.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24高分子材料与工程 -------------------
            '24gfz': {
                '专业名称': '24高分子材料与工程',
                '专业代码': '24gfz',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 12.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': ['材料力学Ⅰ', '固体化学', '电化学基础', '新型碳材料'],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24运动训练 -------------------
            '24ydxl': {
                '专业名称': '24运动训练',
                '专业代码': '24ydxl',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 3.5,
                    '专业知识课程': 6.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24音乐表演 -------------------
            '24yybp': {
                '专业名称': '24音乐表演',
                '专业代码': '24yybp',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 10.0,
                    '工作技能课程': 10.0
                },
                '选修课列表': {
                    '学科基础课程': ['复调', '音乐论文写作基础'],
                    '专业知识课程': ['音乐专业英语', '世界音乐与多元文化概论', '歌唱语音'],
                    '工作技能课程': ['舞台表演', '合唱Ⅰ-1', '合唱Ⅰ-2', '合唱Ⅱ-1', '合唱Ⅲ-1', '合唱Ⅲ-2', '钢琴基础（普修）Ⅰ-1', '钢琴基础（普修）Ⅰ-2', '钢琴基础（普修）Ⅱ-1', '钢琴基础（普修）Ⅱ-2']
                }
            },

            # ------------------- 24大气科学 -------------------
            '24dqkx': {
                '专业名称': '24大气科学',
                '专业代码': '24dqkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 6.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['风暴潮', '应用气象学', '大气辐射与气候', '雷达气象学', '海洋环流', '极地海洋学', '大气化学'],
                    '工作技能课程': ['全球气候变化与应对']
                }
            },

            # ------------------- 24海洋科学(中外合作) -------------------
            '24hykxzw': {
                '专业名称': '24海洋科学(中外合作)',
                '专业代码': '24hykxzw',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 6.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['海洋内波', '海浪', '海洋环流', '潮汐'],
                    '工作技能课程': ['海洋灾害与评估', '海洋前沿讲座-海洋环流', '海洋前沿讲座-海洋波动', 'Linux基础', '海岸带综合管理', '海洋环境管理', '工程环境海洋学']
                }
            },

            # ------------------- 24海洋科学 -------------------
            '24hykx': {
                '专业名称': '24海洋科学',
                '专业代码': '24hykx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 12.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['海洋内波', '海浪', '海洋环流', '极地海洋学', '潮汐'],
                    '工作技能课程': ['海洋前沿讲座-海洋环流', '海洋前沿讲座-海洋波动', 'Linux基础', '海洋环境管理', '海岸带综合管理', '工程环境海洋学']
                }
            },

            # ------------------- 24海洋科学(拔尖班) -------------------
            '24hykxbj': {
                '专业名称': '24海洋科学(拔尖班)',
                '专业代码': '24hykxbj',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24数学与应用数学(海德) -------------------
            '24sxhd': {
                '专业名称': '24数学与应用数学(海德)',
                '专业代码': '24sxhd',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24生物技术(海德) -------------------
            '24swjshd': {
                '专业名称': '24生物技术(海德)',
                '专业代码': '24swjshd',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24食品科学与工程(海德) -------------------
            '24spkxhd': {
                '专业名称': '24食品科学与工程(海德)',
                '专业代码': '24spkxhd',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24保密技术 -------------------
            '24bmjs': {
                '专业名称': '24保密技术',
                '专业代码': '24bmjs',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.0,
                    '专业知识课程': 5.0,
                    '工作技能课程': 2.5
                },
                '选修课列表': {
                    '学科基础课程': ['人工智能II', '并行与分布式计算'],
                    '专业知识课程': ['软件工程', '计算机视觉', '算法设计与分析', '智能计算系统', '海洋大数据分析', '数据分析与数据挖掘', '大数据技术原理与应用', '人工智能安全', '图像处理与分析', '大数据隐私保护技术'],
                    '工作技能课程': ['Web框架编程', '物联网系统设计与开发', '项目管理']
                }
            },

            # ------------------- 24光电信息科学与工程 -------------------
            '24gdxx': {
                '专业名称': '24光电信息科学与工程',
                '专业代码': '24gdxx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.5,
                    '专业知识课程': 4.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['量子力学'],
                    '专业知识课程': ['固体物理', '水声学原理'],
                    '工作技能课程': ['设计性实验', '科研训练1', '科研训练2', '生产实习', '创新与学术实训']
                }
            },

            # ------------------- 24声学 -------------------
            '24shengx': {
                '专业名称': '24声学',
                '专业代码': '24shengx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 6.5
                },
                '选修课列表': {
                    '学科基础课程': ['数字电子技术实验', '微机技术及应用', '微机技术及应用实验', '数值计算方法'],
                    '专业知识课程': [],
                    '工作技能课程': ['科技文献检索与综述', '开放实验Ⅱ', '海上实习', '学科前沿进展与研究']
                }
            },

            # ------------------- 24微电子科学与工程 -------------------
            '24wdz': {
                '专业名称': '24微电子科学与工程',
                '专业代码': '24wdz',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 10.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['微波技术基础', 'MEMS技术导论', '片上系统设计', '射频集成电路基础', '量子力学导论'],
                    '工作技能课程': ['集成电路测试技术与实践', '集成电路与微系统封装技术', '文献阅读与综述']
                }
            },

            # ------------------- 24数据科学与大数据技术 -------------------
            '24sjkx': {
                '专业名称': '24数据科学与大数据技术',
                '专业代码': '24sjkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.0,
                    '专业知识课程': 5.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['自然语言处理', '人工智能II', '网络空间安全导论', '最优化理论与方法'],
                    '专业知识课程': ['信息内容安全', '智能计算系统', '海洋大数据分析', '大数据隐私保护技术', '电路电子学'],
                    '工作技能课程': ['项目管理', '游戏设计与开发']
                }
            },

            # ------------------- 24智能科学与技术 -------------------
            '24znkx': {
                '专业名称': '24智能科学与技术',
                '专业代码': '24znkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.0,
                    '专业知识课程': 5.0,
                    '工作技能课程': 2.5
                },
                '选修课列表': {
                    '学科基础课程': ['并行与分布式计算', '信号与系统', '网络空间安全导论'],
                    '专业知识课程': ['算法设计与分析', '可视化技术', '信息内容安全', '软件工程', '海洋大数据分析', '数据分析与数据挖掘', '人工智能安全', '电路电子学'],
                    '工作技能课程': ['Web框架编程', '物联网系统设计与开发', '项目管理', '游戏设计与开发']
                }
            },

            # ------------------- 24海洋技术 -------------------
            '24hyjs': {
                '专业名称': '24海洋技术',
                '专业代码': '24hyjs',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 5.5
                },
                '选修课列表': {
                    '学科基础课程': ['原子物理学', '理论力学'],
                    '专业知识课程': [],
                    '工作技能课程': ['科技文献检索与综述', '开放实验Ⅱ', '学科前沿进展与研究', '海洋技术综合实习', '海洋技术概论', '海上实习', '海洋光电探测实验', '海洋光学专业实验', '毕业论文', '计算机辅助制图', '电子技能实训', '金工实习', '开放实验Ⅰ', '文献阅读与论文写作', '海洋地理信息系统专业实验', '海洋遥感专业实验']
                }
            },

            # ------------------- 24物理学 -------------------
            '24wlx': {
                '专业名称': '24物理学',
                '专业代码': '24wlx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 3.0,
                    '专业知识课程': 7.0,
                    '工作技能课程': 3.0
                },
                '选修课列表': {
                    '学科基础课程': ['高级语言程序设计', '创新与学术实训'],
                    '专业知识课程': ['微纳光子学', '量子信息实验', '量子场论', '光学实验1', '光学实验2', '激光原理与技术', '光纤通信', '光电技术实验', '光学系统设计', '光电综合实验设计', '光谱学'],
                    '工作技能课程': ['数字图像处理', '专业认知实习', '多物理场仿真分析', '光机结构设计', '光度学与色度学', '光电显示技术']
                }
            },

            # ------------------- 24电子信息科学与技术 -------------------
            '24dzxxkx': {
                '专业名称': '24电子信息科学与技术',
                '专业代码': '24dzxxkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 3.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': ['自动控制原理', '通信原理'],
                    '专业知识课程': [],
                    '工作技能课程': ['电子线路设计与仿真实训', '文献阅读与综述']
                }
            },

            # ------------------- 24电子信息工程 -------------------
            '24dzxxgc': {
                '专业名称': '24电子信息工程',
                '专业代码': '24dzxxgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 3.0,
                    '专业知识课程': 14.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': ['自动控制原理', '通信原理'],
                    '专业知识课程': ['声学基础', '面向对象的程序设计', '数字图像处理', '数据通信与计算机网络', '数字系统设计', '光电技术', '嵌入式系统', '嵌入式系统实验', 'DSP技术及应用', 'DSP技术及应用实验', '天线与电波传播', '检测技术与仪器', 'FPGA应用技术'],
                    '工作技能课程': ['电子线路设计与仿真实训', '文献阅读与综述']
                }
            },

            # ------------------- 24网络空间安全 -------------------
            '24wlkjan': {
                '专业名称': '24网络空间安全',
                '专业代码': '24wlkjan',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.5,
                    '专业知识课程': 5.0,
                    '工作技能课程': 2.5
                },
                '选修课列表': {
                    '学科基础课程': ['人工智能II', '并行与分布式计算', '运筹学基础及应用'],
                    '专业知识课程': [],
                    '工作技能课程': ['Web框架编程', '物联网系统设计与开发', '项目管理', '计算机组网技术']
                }
            },

            # ------------------- 24计算机科学(中外合作) -------------------
            '24jsjkxzw': {
                '专业名称': '24计算机科学(中外合作)',
                '专业代码': '24jsjkxzw',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 7.5,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['嵌入式系统', '线性控制', '高级软件工程', '图像处理', '嵌入式软件'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24计算机科学与技术 -------------------
            '24jsjkx': {
                '专业名称': '24计算机科学与技术',
                '专业代码': '24jsjkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.5,
                    '专业知识课程': 4.0,
                    '工作技能课程': 2.5
                },
                '选修课列表': {
                    '学科基础课程': ['信号与系统', '最优化理论与方法'],
                    '专业知识课程': ['计算机视觉', '算法设计与分析', '可视化技术', '软件性能工程', '智能计算系统', '大数据技术原理与应用', '海洋大数据分析', '数据分析与数据挖掘', '图像处理与分析'],
                    '工作技能课程': ['物联网系统设计与开发', '游戏设计与开发']
                }
            },

            # ------------------- 24软件工程 -------------------
            '24rjgc': {
                '专业名称': '24软件工程',
                '专业代码': '24rjgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.5,
                    '专业知识课程': 4.0,
                    '工作技能课程': 2.5
                },
                '选修课列表': {
                    '学科基础课程': ['并行与分布式计算', '运筹学基础及应用', '网络空间安全导论'],
                    '专业知识课程': ['计算机视觉', '图像处理与分析', '算法设计与分析', '可视化技术', '系统安全技术', '网络安全技术', '信息系统安全工程', '智能计算系统'],
                    '工作技能课程': ['物联网系统设计与开发', '游戏设计与开发', '项目管理']
                }
            },

            # ------------------- 24通信工程 -------------------
            '24txgc': {
                '专业名称': '24通信工程',
                '专业代码': '24txgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 12.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': ['电子线路设计与仿真实训', '文献阅读与综述']
                }
            },

            # ------------------- 24化学工程与工艺 -------------------
            '24hxgc': {
                '专业名称': '24化学工程与工艺',
                '专业代码': '24hxgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 6.0,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['生物化工', '海洋腐蚀与防护技术', '可再生能源工程'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24化学 -------------------
            '24hx': {
                '专业名称': '24化学',
                '专业代码': '24hx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 11.5,
                    '工作技能课程': 6.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['海洋资源化学', '有机合成化学', '精细化学品化学', '催化原理与技术', '应用电化学', '新生导航课', '海洋学II', '结构化学', '化学海洋学', '化学海洋学实验', '有机波谱分析', '海洋物理化学', '海洋化学进展', '化学前沿', '河口化学', '地球化学基础', '海洋环境化学', '化工原理 II', '化工原理实验 II', '生态学基础', '生物化学基础'],
                    '工作技能课程': ['计算机在化学中的应用', '分离与富集', '海洋腐蚀与防护技术', '认识实习', '海水分析化学', '海水分析化学实验', '海洋学和海洋化学观测实验', '专业综合实验', '毕业论文', '化学信息学']
                }
            },

            # ------------------- 24地球信息科学与技术 -------------------
            '24dx24': {
                '专业名称': '24地球信息科学与技术',
                '专业代码': '24dx24',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 6.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['海洋工程地质', '海洋遥感概论', '计算地球物理原理', '专业前沿研讨', '海洋沉积物分析', '地球系统科学'],
                    '工作技能课程': ['地质旅行Ⅱ']
                }
            },

            # ------------------- 24地质学 -------------------
            '24dz24': {
                '专业名称': '24地质学',
                '专业代码': '24dz24',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 9.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': ['地理信息系统', '工程岩土学'],
                    '专业知识课程': ['海底岩石学', '沉积环境与沉积相', '海洋工程地质', '海底矿产资源', '海洋地球化学', '海洋工程环境', '海洋地质学前沿', '环境地质学', '地球系统科学'],
                    '工作技能课程': ['地学建模与可视化', '现代分析测试方法']
                }
            },

            # ------------------- 24生态学 -------------------
            '24stx': {
                '专业名称': '24生态学',
                '专业代码': '24stx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 7.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': ['遗传学', '动物生理学', '动物生理学实验', '发育生物学', '发育生物学实验'],
                    '专业知识课程': ['海洋微生物学', '海洋微生物学实验', '恢复生态学', '病毒学', '分子生态学', '湿地生态学', '海洋生态灾害学', '海洋生物学及海洋学实习', '环境工程', '海洋微型生物生态学', '生物地球化学循环'],
                    '工作技能课程': ['潜水与海底生物调查', '生态规划与设计', '生物安全理论与法规']
                }
            },

            # ------------------- 24生物技术 -------------------
            '24swjs': {
                '专业名称': '24生物技术',
                '专业代码': '24swjs',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24生物科学 -------------------
            '24swkx': {
                '专业名称': '24生物科学',
                '专业代码': '24swkx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 3.0,
                    '专业知识课程': 13.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': ['海洋学2', '海洋生物学及海洋学实习'],
                    '专业知识课程': ['生物海洋学', '神经生物学', '生物信息学', '进化生物学', '饵料生物学', '系统生物学', '免疫学', '免疫学实验', '病毒学', '基因组学', '海洋生态学实验', '海洋生物功能材料', '表观遗传学', '免疫遗传学', '定量生物学', '微生物生理学', '遗传学前沿导论', '蛋白质化学与蛋白质组学'],
                    '工作技能课程': ['细胞工程', '藻类遗传与育种', '海洋生态灾害学', '潜水与海底生物调查', '药用海洋生物', '干细胞技术与应用', '生物检测技术与仪器概论', '海洋生物先天免疫学']
                }
            },

            # ------------------- 24水产养殖学 -------------------
            '24scyz': {
                '专业名称': '24水产养殖学',
                '专业代码': '24scyz',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 6.0,
                    '工作技能课程': 1.0
                },
                '选修课列表': {
                    '学科基础课程': ['植物生理学实验', '海洋学实习', '生物实验技术', '生物实验技术实验', '动物免疫学', '生物信息学'],
                    '专业知识课程': ['藻类与藻类栽培', '水产特种经济动物养殖学', '水产品安全与质量管理', '分子营养学', '增殖工程与海洋牧场', '渔业经济与管理'],
                    '工作技能课程': ['水产养殖生产实习', '毕业论文', '水产饲料检测和加工技术', '水产养殖前沿讲座']
                }
            },

            # ------------------- 24海洋渔业科学与技术 -------------------
            '24hyyy': {
                '专业名称': '24海洋渔业科学与技术',
                '专业代码': '24hyyy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 8.0,
                    '专业知识课程': 7.5,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': ['计算机图形学', '神经网络与深度学习', '人工智能导论', '养殖土木工程学', '海洋环境生态学'],
                    '专业知识课程': ['极地与远洋渔业科学进展', '海洋与渔业法规', '渔业经济与管理', '国际渔业'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24海洋资源与环境 -------------------
            '24hyzyhj': {
                '专业名称': '24海洋资源与环境',
                '专业代码': '24hyzyhj',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 6.0,
                    '专业知识课程': 8.0,
                    '工作技能课程': 1.0
                },
                '选修课列表': {
                    '学科基础课程': ['动物生理学', '动物生理学实验', '基础分子生物学', '基础分子生物学实验', '海洋浮游生物学', '海洋浮游生物学实验', '生物信息学'],
                    '专业知识课程': ['极地与远洋渔业科学进展', '国际渔业', '养殖水环境工程学', '增殖工程与海洋牧场', '国际课程'],
                    '工作技能课程': ['渔政管理与渔港监督实习']
                }
            },

            # ------------------- 24海洋资源开发技术 -------------------
            '24hyzykf': {
                '专业名称': '24海洋资源开发技术',
                '专业代码': '24hyzykf',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 8.0,
                    '专业知识课程': 10.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': ['跨学科基础核心课'],
                    '专业知识课程': [],
                    '工作技能课程': ['网络安全与保密法律基础', '文献检索与交互应用']
                }
            },

            # ------------------- 24食品科学与工程 -------------------
            '24spkxgc': {
                '专业名称': '24食品科学与工程',
                '专业代码': '24spkxgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24食品营养与健康 -------------------
            '24spyy': {
                '专业名称': '24食品营养与健康',
                '专业代码': '24spyy',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 1.0
                },
                '选修课列表': {
                    '学科基础课程': ['医学免疫学', '海洋药食同源资源开发', '跨学科基础核心课'],
                    '专业知识课程': ['食品工程高新技术', '海洋健康功能材料', '益生菌与人体健康', '跨学科专业知识核心课', '国际课程—食品免疫学', '国际课程—糖科学基础及前沿技', '国际交流活动', '跨学科专业国际课程'],
                    '工作技能课程': ['食品信息化技术']
                }
            },

            # ------------------- 24药学 -------------------
            '24yx': {
                '专业名称': '24药学',
                '专业代码': '24yx',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 5.0,
                    '专业知识课程': 7.0,
                    '工作技能课程': 4.0
                },
                '选修课列表': {
                    '学科基础课程': ['糖化学生物学(国际课程)', '基因工程技术(国际课程)', '药用海洋生物'],
                    '专业知识课程': ['生物药剂学与药物动力学', '临床药学概论', '药学与交叉学科创新系列'],
                    '工作技能课程': ['药学英语', 'GMP实习', '潜水与海底生物调查']
                }
            },

            # ------------------- 24土木工程 -------------------
            '24tmgc': {
                '专业名称': '24土木工程',
                '专业代码': '24tmgc',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 12.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': ['电工学'],
                    '专业知识课程': ['大跨空间结构', 'BIM技术原理及其应用', '岩土工程灾害分析与防治', '船舶与海洋工程导论', '工程水文学', '岩体力学', '地下结构设计', '特种结构', '结构事故分析与处理', '岩土工程测试技术', '地下建筑施工'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24工业设计 -------------------
            '24gysj': {
                '专业名称': '24工业设计',
                '专业代码': '24gysj',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 0.0,
                    '专业知识课程': 14.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': [],
                    '专业知识课程': ['智能产品开发与设计', '绿色创新设计', '设计语言学', '产品摄影', '设计管理与战略'],
                    '工作技能课程': []
                }
            },

            # ------------------- 24机械设计制造及其自动化 -------------------
            '24jxsj': {
                '专业名称': '24机械设计制造及其自动化',
                '专业代码': '24jxsj',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 1.0
                },
                '选修课列表': {
                    '学科基础课程': ['海洋工程环境', '海洋可再生能源利用技术'],
                    '专业知识课程': ['智能控制技术（双语）', '工业企业管理', '机械创新设计'],
                    '工作技能课程': ['大数据应用与船联网技术', '沟通与工程写作（双语）']
                }
            },

            # ------------------- 24港口航道与海岸工程 -------------------
            '24gkhd': {
                '专业名称': '24港口航道与海岸工程',
                '专业代码': '24gkhd',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 0.0,
                    '工作技能课程': 0.0
                },
                '选修课列表': {
                    '学科基础课程': ['弹性力学'],
                    '专业知识课程': [],
                    '工作技能课程': []
                }
            },

            # ------------------- 24自动化 -------------------
            '24zdh': {
                '专业名称': '24自动化',
                '专业代码': '24zdh',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 2.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 1.0
                },
                '选修课列表': {
                    '学科基础课程': ['海洋工程环境', '海洋可再生能源利用技术'],
                    '专业知识课程': ['智能控制技术（双语）', '工业企业管理', '机械创新设计'],
                    '工作技能课程': ['大数据应用与船联网技术', '沟通与工程写作（双语）']
                }
            },

            # ------------------- 24船舶与海洋工程 -------------------
            '24cb': {
                '专业名称': '24船舶与海洋工程',
                '专业代码': '24cb',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 4.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 2.0
                },
                '选修课列表': {
                    '学科基础课程': ['船舶与海洋工程经济学', '海洋工程水动力学'],
                    '专业知识课程': ['海洋可再生能源利用技术', '海洋工程结构疲劳与断裂'],
                    '工作技能课程': ['结构振动测试技术']
                }
            },

            # ------------------- 24轮机工程 -------------------
            '24lj': {
                '专业名称': '24轮机工程',
                '专业代码': '24lj',
                '有卓越班': False,
                '学分要求': {
                    '学科基础课程': 3.0,
                    '专业知识课程': 4.0,
                    '工作技能课程': 1.0
                },
                '选修课列表': {
                    '学科基础课程': ['可编程逻辑控制技术', '大数据应用与船联网技术'],
                    '专业知识课程': ['智能控制技术(双语)', '国际化课程', '振动噪声控制基础'],
                    '工作技能课程': []
                }
            },


# ============ 以下添加到 self.major_display_list 中 ============
            {'code': '24hjgc', 'name': '24环境工程', 'emoji': '🌿'},
            {'code': '24hjkx', 'name': '24环境科学', 'emoji': '🌱'},
            {'code': '24kuaijiACCA', 'name': '24会计学(ACCA)', 'emoji': '💼'},
            {'code': '24kuaiji', 'name': '24会计学', 'emoji': '📊'},
            {'code': '24gsgl', 'name': '24工商管理', 'emoji': '🏢'},
            {'code': '24scyx', 'name': '24市场营销', 'emoji': '📈'},
            {'code': '24lygl', 'name': '24旅游管理', 'emoji': '✈️'},
            {'code': '24cwgl', 'name': '24财务管理', 'emoji': '💰'},
            {'code': '24gjmy', 'name': '24国际经济与贸易', 'emoji': '🌐'},
            {'code': '24wlgl', 'name': '24物流管理', 'emoji': '🚚'},
            {'code': '24jjx', 'name': '24经济学(海洋经济)', 'emoji': '📉'},
            {'code': '24jrxCFA', 'name': '24金融学(CFA)', 'emoji': '💹'},
            {'code': '24jrx', 'name': '24金融学', 'emoji': '🏦'},
            {'code': '24dey', 'name': '24德语', 'emoji': '🇩🇪'},
            {'code': '24ry', 'name': '24日语', 'emoji': '🇯🇵'},
            {'code': '24cxy', 'name': '24朝鲜语', 'emoji': '🇰🇷'},
            {'code': '24fy', 'name': '24法语', 'emoji': '🇫🇷'},
            {'code': '24yy', 'name': '24英语', 'emoji': '🇬🇧'},
            {'code': '24xwx', 'name': '24新闻学', 'emoji': '📰'},
            {'code': '24hywx', 'name': '24汉语言文学', 'emoji': '📖'},
            {'code': '24wlxmt', 'name': '24网络与新媒体', 'emoji': '📱'},
            {'code': '24fxzw', 'name': '24法学(中外合作)', 'emoji': '⚖️'},
            {'code': '24fx', 'name': '24法学', 'emoji': '⚖️'},
            {'code': '24ggsy', 'name': '24公共事业管理', 'emoji': '🏛️'},
            {'code': '24zzx', 'name': '24政治学与行政学', 'emoji': '🏛️'},
            {'code': '24xzgl', 'name': '24行政管理', 'emoji': '🏛️'},
            {'code': '24xxjskx', 'name': '24信息与计算科学', 'emoji': '🔢'},
            {'code': '24sx', 'name': '24数学与应用数学', 'emoji': '📐'},
            {'code': '24xny', 'name': '24新能源材料与器件', 'emoji': '⚡'},
            {'code': '24clkx', 'name': '24材料科学与工程', 'emoji': '🔬'},
            {'code': '24gfz', 'name': '24高分子材料与工程', 'emoji': '🧬'},
            {'code': '24ydxl', 'name': '24运动训练', 'emoji': '🏃'},
            {'code': '24yybp', 'name': '24音乐表演', 'emoji': '🎵'},
            {'code': '24dqkx', 'name': '24大气科学', 'emoji': '🌤️'},
            {'code': '24hykxzw', 'name': '24海洋科学(中外合作)', 'emoji': '🌊'},
            {'code': '24hykx', 'name': '24海洋科学', 'emoji': '🌊'},
            {'code': '24hykxbj', 'name': '24海洋科学(拔尖班)', 'emoji': '🌟'},
            {'code': '24sxhd', 'name': '24数学与应用数学(海德)', 'emoji': '🔢'},
            {'code': '24swjshd', 'name': '24生物技术(海德)', 'emoji': '🧬'},
            {'code': '24spkxhd', 'name': '24食品科学与工程(海德)', 'emoji': '🍽️'},
            {'code': '24bmjs', 'name': '24保密技术', 'emoji': '🔒'},
            {'code': '24gdxx', 'name': '24光电信息科学与工程', 'emoji': '💡'},
            {'code': '24shengx', 'name': '24声学', 'emoji': '🔊'},
            {'code': '24wdz', 'name': '24微电子科学与工程', 'emoji': '🔌'},
            {'code': '24sjkx', 'name': '24数据科学与大数据技术', 'emoji': '📊'},
            {'code': '24znkx', 'name': '24智能科学与技术', 'emoji': '🤖'},
            {'code': '24hyjs', 'name': '24海洋技术', 'emoji': '⚓'},
            {'code': '24wlx', 'name': '24物理学', 'emoji': '⚛️'},
            {'code': '24dzxxkx', 'name': '24电子信息科学与技术', 'emoji': '💻'},
            {'code': '24dzxxgc', 'name': '24电子信息工程', 'emoji': '📡'},
            {'code': '24wlkjan', 'name': '24网络空间安全', 'emoji': '🛡️'},
            {'code': '24jsjkxzw', 'name': '24计算机科学(中外合作)', 'emoji': '💻'},
            {'code': '24jsjkx', 'name': '24计算机科学与技术', 'emoji': '💻'},
            {'code': '24rjgc', 'name': '24软件工程', 'emoji': '⚙️'},
            {'code': '24txgc', 'name': '24通信工程', 'emoji': '📶'},
            {'code': '24hxgc', 'name': '24化学工程与工艺', 'emoji': '⚗️'},
            {'code': '24hx', 'name': '24化学', 'emoji': '🧪'},
            {'code': '24dx24', 'name': '24地球信息科学与技术', 'emoji': '🛰️'},
            {'code': '24dz24', 'name': '24地质学', 'emoji': '🗺️'},
            {'code': '24stx', 'name': '24生态学', 'emoji': '🌿'},
            {'code': '24swjs', 'name': '24生物技术', 'emoji': '🧬'},
            {'code': '24swkx', 'name': '24生物科学', 'emoji': '🔬'},
            {'code': '24scyz', 'name': '24水产养殖学', 'emoji': '🐟'},
            {'code': '24hyyy', 'name': '24海洋渔业科学与技术', 'emoji': '🎣'},
            {'code': '24hyzyhj', 'name': '24海洋资源与环境', 'emoji': '🌊'},
            {'code': '24hyzykf', 'name': '24海洋资源开发技术', 'emoji': '🔧'},
            {'code': '24spkxgc', 'name': '24食品科学与工程', 'emoji': '🍽️'},
            {'code': '24spyy', 'name': '24食品营养与健康', 'emoji': '🥗'},
            {'code': '24yx', 'name': '24药学', 'emoji': '💊'},
            {'code': '24tmgc', 'name': '24土木工程', 'emoji': '🏗️'},
            {'code': '24gysj', 'name': '24工业设计', 'emoji': '✏️'},
            {'code': '24jxsj', 'name': '24机械设计制造及其自动化', 'emoji': '⚙️'},
            {'code': '24gkhd', 'name': '24港口航道与海岸工程', 'emoji': '⚓'},
            {'code': '24zdh', 'name': '24自动化', 'emoji': '🤖'},
            {'code': '24cb', 'name': '24船舶与海洋工程', 'emoji': '🚢'},
            {'code': '24lj', 'name': '24轮机工程', 'emoji': '⚙️'},