# -*- coding: utf-8 -*-
"""23级（2022版培养方案）专业配置。新增专业：在 MAJORS_23 加一项，DISPLAY_23 加一行。"""

MAJORS_23 = {
    '23kg': {
        '专业名称': '23勘工',
        '专业代码': '23kg',
        '有卓越班': True,
        '卓越班级学号集': {'23040031008', '23040031009', '23040031016', '23040031023', '23040031024', '23040031035', '23040031036', '23040031038', '23040031049', '23040031050', '23040031051', '23040031061', '23040031068', '23040031069'},
        '学分要求': {'卓越': {'学科基础课程': 1.0, '专业知识课程': 1.0, '工作技能课程': 0.0}, '普通': {'学科基础课程': 4.0, '专业知识课程': 4.0, '工作技能课程': 2.0}},
        '选修课列表': {
            '卓越': {
                '学科基础课程': ['Python程序设计与实践', '岩石物理学基础', '科学计算语言与编程', '电工电子学', '数据结构', '计算机图形学', '地理信息系统', '海洋地质学概论', '并行编程原理与程序设计', '专业英语与科技写作'],
                '专业知识课程': ['地球物理测井', '油气地质学', '计算地球物理原理', '工程与环境地球物理', '地球物理大数据与人工智能', '非常规油气勘探开发', '地球物理前沿讲座', '海洋电磁学', '地学软件工程'],
                '工作技能课程': [],
            },
            '普通': {
                '学科基础课程': ['科学计算语言与编程', 'Python程序设计与实践', '海洋地质学概论', '电工电子学', '数据结构', '计算机图形学', '地理信息系统', '并行编程原理与程序设计', '专业英语与科技写作'],
                '专业知识课程': ['地球物理测井', '油气地质学', '工程与环境地球物理', '地球物理大数据与人工智能', '海洋地球物理探测技术', '计算地球物理原理', '三维地震勘探', '非常规油气勘探开发', '人工智能资料处理与解释', '海洋电磁学', '地学软件工程'],
                '工作技能课程': ['地球物理技能训练', '地球物理软件设计实习', '工程实践'],
            },
        }
    },
    '23dz': {
        '专业名称': '23地质',
        '专业代码': '23dz',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 7.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['线性代数', '物理化学实验'],
            '专业知识课程': ['海底岩石学', '海洋工程地质', '海底矿产资源', '海洋工程环境', '环境地质学'],
            '工作技能课程': ['地学建模与可视化', '地质旅行Ⅲ', '地质学研究方法新进展'],
        }
    },
    '23dx': {
        '专业名称': '23地信',
        '专业代码': '23dx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 6.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['计算机图形学', 'AutoCAD制图与应用', '专业英语'],
            '专业知识课程': ['海洋工程地质', '计算地球物理原理', '海洋沉积物分析'],
            '工作技能课程': ['地质旅行Ⅱ'],
        }
    },
    '23hykxbj': {
        '专业名称': '23海洋科学(拔尖)',
        '专业代码': '23hykxbj',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': ['海水分析化学', '生态毒理学', '生物化学实验'],
        }
    },
    '23swkxbj': {
        '专业名称': '23生物科学(拔尖)',
        '专业代码': '23swkxbj',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['Diving and Marine', 'Protein Chemistry and', '创新创业教育', 'Methodology of Scientiﬁc', '科研素质培养与训练'],
            '工作技能课程': [],
        }
    },
    '23swjshd': {
        '专业名称': '23生物技术(海德)',
        '专业代码': '23swjshd',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': [],
        }
    },
    '23spkxhd': {
        '专业名称': '23食品科学(海德)',
        '专业代码': '23spkxhd',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': [],
        }
    },
    '23sxhd': {
        '专业名称': '23数学(海德)',
        '专业代码': '23sxhd',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': [],
        }
    },
    '23ydxl': {
        '专业名称': '23运动训练',
        '专业代码': '23ydxl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 15.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['运动营养学', '体适能理论与方法'],
            '专业知识课程': ['（A）健美操', '（A）乒乓球'],
            '工作技能课程': ['*运动生理学', '*运动心理学', '*运动医学', '*运动竞赛学', '运动训练专业导论', '毕业实习'],
        }
    },
    '23yybp': {
        '专业名称': '23音乐表演',
        '专业代码': '23yybp',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 10.0, '工作技能课程': 10.0},
        '选修课列表': {
            '学科基础课程': ['中国民族民间音乐', '教育学'],
            '专业知识课程': ['世界音乐与多元文化概论', '电脑音乐基础Ⅱ'],
            '工作技能课程': ['钢琴即兴伴奏'],
        }
    },
    '23clkx': {
        '专业名称': '23材料科学与工程',
        '专业代码': '23clkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 19.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['（五选', '计算材料学'],
            '专业知识课程': ['新能源材料与技术', '光电子材料与器件', '多孔能源与催化材料', '必选）'],
            '工作技能课程': [],
        }
    },
    '23gfz': {
        '专业名称': '23高分子材料与工程',
        '专业代码': '23gfz',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 8.0, '工作技能课程': 8.0},
        '选修课列表': {
            '学科基础课程': ['分）', '电化学基础'],
            '专业知识课程': ['材料腐蚀与防护技术', '新型碳材料', '金属材料概论', '高分子材料改性'],
            '工作技能课程': ['材料科学与工程基础', '高分子化学', '聚合物复合材料工程', '高分子物理', '聚合反应工程', '高分子材料改性', '高分子化学实验', '涂料与胶粘剂', '高分子材料功能助剂', '高分子物理实验', '功能高分子材料'],
        }
    },
    '23sx': {
        '专业名称': '23数学与应用数学',
        '专业代码': '23sx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 18.0, '工作技能课程': 7.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['现代复分析导引', '海洋科学初探', '数学与海洋', '地球科学概论', '流体力学', '微观经济学'],
            '工作技能课程': ['C++ 面向对象的程', '统计软件', '软件实训'],
        }
    },
    '23xxjskx': {
        '专业名称': '23信息与计算科学',
        '专业代码': '23xxjskx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 18.0, '专业知识课程': 18.0, '工作技能课程': 7.0},
        '选修课列表': {
            '学科基础课程': ['统计计算', '矩阵计算', '一般拓扑学', '计算复杂性理论', '现代复分析导引'],
            '专业知识课程': ['统计计算', '一般拓扑学', '现代复分析导引', '海洋科学初探', '数学与海洋', '地球科学概论', '流体力学', '微观经济学'],
            '工作技能课程': ['C++ 面向对象的程', '统计软件', '软件实训'],
        }
    },
    '23zzx': {
        '专业名称': '23政治学与行政学',
        '专业代码': '23zzx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 10.0, '专业知识课程': 12.0, '工作技能课程': 3.0},
        '选修课列表': {
            '学科基础课程': ['政治学经典著作选读'],
            '专业知识课程': ['政治学学科前沿课', '当代中国外交', '政治学前沿讲座', '日本政治与外交'],
            '工作技能课程': ['职业能力拓展', '公文写作', '政治学原理', '国际政治学', '公共行政学', '西方政治思想史', '当代中国政府与政治', '公共经济学', '中国政治制度史', '中国政治思想史', '比较政治制度'],
        }
    },
    '23ggsy': {
        '专业名称': '23公共事业管理',
        '专业代码': '23ggsy',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 12.0, '专业知识课程': 12.5, '工作技能课程': 1.5},
        '选修课列表': {
            '学科基础课程': ['行政法与行政', '公共管理学'],
            '专业知识课程': ['公共政策分析', '农业农村政策学', '海洋公共政策'],
            '工作技能课程': ['专题讲座'],
        }
    },
    '23xzgl': {
        '专业名称': '23行政管理',
        '专业代码': '23xzgl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 8.0, '专业知识课程': 10.0, '工作技能课程': 1.5},
        '选修课列表': {
            '学科基础课程': ['中外经典著作选读'],
            '专业知识课程': ['可持续发展导论（英文）', '环境政策与管理（双语）', '土地资源管理概论', '公共危机管理'],
            '工作技能课程': ['行政能力测评与申论', '专题讲座'],
        }
    },
    '23fx': {
        '专业名称': '23法学',
        '专业代码': '23fx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 14.0, '工作技能课程': 8.0},
        '选修课列表': {
            '学科基础课程': ['法律经济学', '外国法制史'],
            '专业知识课程': ['证据学', '国际环境法学', '外国刑法学', '金融法学', '法科资源检索与利用'],
            '工作技能课程': ['刑事诊所教学', '国际法诊所教学', '行政诊所教学', '前沿系列讲座', '大学生职业发展教育Ⅱ', '大学生职业发展教育Ⅲ'],
        }
    },
    '23fxzw': {
        '专业名称': '23法学(中外合作)',
        '专业代码': '23fxzw',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 9.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['*国际环境法', '*法学专项研究'],
            '工作技能课程': [],
        }
    },
    '23hywx': {
        '专业名称': '23汉语言文学',
        '专业代码': '23hywx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 31.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['中西诗学比较研究', '志怪小说与民俗文化', '东亚文化交流专题', '中国现代文学史料学', '唐人小说与唐代社会生活', '甲骨文与商周文明'],
            '工作技能课程': ['应用文写作', '古文字智能处理与视觉创意', '口才学理论与实践', '学术前沿讲座'],
        }
    },
    '23whcygl': {
        '专业名称': '23文化产业管理',
        '专业代码': '23whcygl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 15.0, '专业知识课程': 31.0, '工作技能课程': 8.0},
        '选修课列表': {
            '学科基础课程': ['学术研究实践系列讲座', '文化产业经典导读', '外国文学名著导读'],
            '专业知识课程': ['文博创意与开发', '古代文物与海上丝路', '名家课程Ⅱ', '中国历史地理与文化景观', '文旅融合理论与实践', '考古发现与中国文化', '日韩文化资源与产业化'],
            '工作技能课程': ['影视艺术专题'],
        }
    },
    '23xwx': {
        '专业名称': '23新闻学',
        '专业代码': '23xwx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 14.0, '专业知识课程': 25.0, '工作技能课程': 10.0},
        '选修课列表': {
            '学科基础课程': ['中国文化史', '现代经济学', '政治学'],
            '专业知识课程': ['危机传播管理'],
            '工作技能课程': ['广播电视新闻实务', '新闻漫画'],
        }
    },
    '23wlxmt': {
        '专业名称': '23网络与新媒体',
        '专业代码': '23wlxmt',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 14.0, '专业知识课程': 19.0, '工作技能课程': 7.0},
        '选修课列表': {
            '学科基础课程': ['社会学', '现代经济学', '政治学'],
            '专业知识课程': ['新媒体用户行为', '数字出版学', '媒介经营与管理', '传播与社会记忆'],
            '工作技能课程': ['广播电视新闻实务', '校园媒体实践', '新媒体创意工作坊'],
        }
    },
    '23yy': {
        '专业名称': '23英语',
        '专业代码': '23yy',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 8.0, '专业知识课程': 14.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['汉语修辞', '中国现代文学专题'],
            '专业知识课程': ['全球治理导论', '美国政治与外交', '外交礼仪'],
            '工作技能课程': [],
        }
    },
    '23ry': {
        '专业名称': '23日语',
        '专业代码': '23ry',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 4.0, '工作技能课程': 6.5},
        '选修课列表': {
            '学科基础课程': ['日语专业导航', '*基础日语Ⅰ', '*基础日语Ⅲ', '*高级日语Ⅰ', '日语阅读评析Ⅰ', '*日语会话Ⅰ', '*日语会话Ⅲ', '*日语听力Ⅱ', '*基础写作Ⅰ', '*应用文写作'],
            '专业知识课程': ['中日影视文化传播', '中日语言对比分析'],
            '工作技能课程': ['课题研讨与论文', '国际贸易实务', '学科前沿讲座'],
        }
    },
    '23cxy': {
        '专业名称': '23朝鲜语',
        '专业代码': '23cxy',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 2.0, '工作技能课程': 2.0},
        '选修课列表': {
            '学科基础课程': ['*初级韩国语Ⅱ', '*中级韩国语Ⅱ', '*高级韩国语Ⅱ', '*韩国语阅读Ⅱ', '*韩国语阅读Ⅳ', '*初级韩国语会话Ⅱ', '*中级韩国语会话Ⅱ', '*高级韩国语会话Ⅱ', '*韩国语听力Ⅱ', '*韩国语听力Ⅳ', '*韩国语写作Ⅰ', '朝鲜（韩国）语'],
            '专业知识课程': ['毕业论文', '毕业实习', '创新创业教育', '中韩跨文化实践', '韩国语言实习', '学术前沿讲座'],
            '工作技能课程': ['韩国语言实习', '学术前沿讲座'],
        }
    },
    '23fy': {
        '专业名称': '23法语',
        '专业代码': '23fy',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 4.0, '工作技能课程': 2.0},
        '选修课列表': {
            '学科基础课程': ['法语听力', '法语语法'],
            '专业知识课程': ['经济法语Ⅱ'],
            '工作技能课程': ['汉语写作', '法语口译', '基础法语Ⅰ', '中级法语Ⅰ', '基础法语Ⅱ', '法语语音', '法语视听说Ⅰ', '法语听力', '法语视听说Ⅱ'],
        }
    },
    '23dey': {
        '专业名称': '23德语',
        '专业代码': '23dey',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 10.0, '工作技能课程': 6.0},
        '选修课列表': {
            '学科基础课程': ['德语专业导航', '*基础德语Ⅰ', '*基础德语Ⅱ', '*学科基础素质Ⅰ', '*中级德语Ⅰ', '德语听说训练Ⅲ', '德语听说训练Ⅳ', '*学科基础素质Ⅱ', '*高级德语Ⅰ', '高级英语Ⅱ'],
            '专业知识课程': ['德语语言学专题研讨课Ⅰ', '德汉笔译'],
            '工作技能课程': ['德语', '英汉互译 三（秋）', '德汉口译 三（春）', '德汉翻译', '毕业论文 三（春）'],
        }
    },
    '23jrx': {
        '专业名称': '23金融学',
        '专业代码': '23jrx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 14.0, '专业知识课程': 17.0, '工作技能课程': 5.0},
        '选修课列表': {
            '学科基础课程': ['国际贸易理论与', '国家税收', '经济法'],
            '专业知识课程': ['涉海金融', '行为金融学（双语）'],
            '工作技能课程': ['期货暨衍生品理论', '量化投资基础', '金融论坛'],
        }
    },
    '23gjmy': {
        '专业名称': '23国际经济与贸易',
        '专业代码': '23gjmy',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 10.0, '专业知识课程': 9.0, '工作技能课程': 2.5},
        '选修课列表': {
            '学科基础课程': ['国际经济与贸易专', '国际贸易理论', '国际贸易实务', '中国对外贸易理', '国际市场营销学', '国际投资与跨国', '外贸英语函电', '国际经济合作', '国际商务沟通与谈', '国际商法', '自贸区经济与保税', '世界市场行情', '国际贸易运输与保', '港口经济与管理', '国际服务贸易', '博弈论导论', '财政学'],
            '专业知识课程': ['港口经济与管理', '国际经贸前沿问题', '博弈论导论'],
            '工作技能课程': ['专业外语', '社会调查', '微观经济学', '国际金融学', '宏观经济学', '国际市场营销学', '国际贸易理论', '中国对外贸易理论与政策', '国际贸易实务', '外贸英语函电', '国际经济合作', '世界市场行情', '国际投资与跨国管理', '世界经济贸易地理'],
        }
    },
    '23wlgl': {
        '专业名称': '23物流管理',
        '专业代码': '23wlgl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 10.0, '专业知识课程': 10.0, '工作技能课程': 8.0},
        '选修课列表': {
            '学科基础课程': ['国际贸易实务', '国际金融学（双语）'],
            '专业知识课程': ['国际经济合作', '国际结算（双语）', '物流规制'],
            '工作技能课程': ['进出口业务模拟实', '社会调查', '物流专业外语'],
        }
    },
    '23jjx': {
        '专业名称': '23经济学',
        '专业代码': '23jjx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 9.0, '专业知识课程': 11.0, '工作技能课程': 3.0},
        '选修课列表': {
            '学科基础课程': ['行为与实验经济学', '英语口语Ⅰ'],
            '专业知识课程': ['运筹学', '海洋旅游学'],
            '工作技能课程': ['海洋经济认知实习', '海洋经济专题讲'],
        }
    },
    '23gsgl': {
        '专业名称': '23工商管理',
        '专业代码': '23gsgl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 9.0, '专业知识课程': 12.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['系统工程', '管理统计学'],
            '专业知识课程': ['营运资金管理', '管理沟通'],
            '工作技能课程': ['专业社会实践', '智能管理模拟', '企业经营模拟'],
        }
    },
    '23kuaiji': {
        '专业名称': '23会计学',
        '专业代码': '23kuaiji',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 10.0, '专业知识课程': 15.0, '工作技能课程': 12.0},
        '选修课列表': {
            '学科基础课程': ['管理信息系统', '公共关系和社交礼仪'],
            '专业知识课程': ['税收筹划', '*数量财务', '研究方法训练夏令营'],
            '工作技能课程': ['智能管理模拟', '企业经营模拟', '创新研究项目', '创业实践策划', '预算管理', '成本管理控制', '营运资金管理', '资本运营实务', '政府审计', '其他鉴证业务', '管理学原理', '管理会计', '基础会计', '财务管理', '中级财务会计', '经济法', '业绩管控模块课', '审计学原理与实务', '财务成本管理模块课', '税法', '智能财务共享与会计信息化', '高级财务会计'],
        }
    },
    '23kuaijiACCA': {
        '专业名称': '23会计学(ACCA)',
        '专业代码': '23kuaijiACCA',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 7.0, '专业知识课程': 9.0, '工作技能课程': 18.0},
        '选修课列表': {
            '学科基础课程': ['金融学', '管理信息系统', '财经应用文写作', '公共关系和社交礼仪', '市场营销'],
            '专业知识课程': ['政府及非营利组织会计', '金融企业会计', '管理咨询', '商业模式创新与共赢增值表', '智能财务共享与会计信息化', '税收筹划', '专业辩论训练夏令营', '研究方法训练夏令营', '投资银行与财富管理夏令营'],
            '工作技能课程': ['工商管理特色实践1', '工商管理特色实践2', '工商管理特色实践3', '工商管理特色实践4', '专业社会实践导论', '智能管理模拟', '企业经营模拟', '多媒体会计模拟实习', '创新研究项目', '创业实践策划', '薪酬制度体系设计', '营运资金管理', '政府审计', '高级财务管理P4', '高级业绩管理P3', '机器人商业企划与创新实践'],
        }
    },
    '23cwgl': {
        '专业名称': '23财务管理',
        '专业代码': '23cwgl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 10.0, '专业知识课程': 10.0, '工作技能课程': 10.0},
        '选修课列表': {
            '学科基础课程': ['管理信息系统', '公共关系和社交礼仪'],
            '专业知识课程': ['专业辩论训练夏令营', '研究方法训练夏令营', '投资银行与财富管理'],
            '工作技能课程': ['创业实践策划', '成本管理控制', '营运资金管理', '经济学', '会计学', '高级公司财务', '财务分析', '财务学原理', '财务计量经济学', '公司财务', '数量财务'],
        }
    },
    '23scyx': {
        '专业名称': '23市场营销',
        '专业代码': '23scyx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['海洋经济与海上丝绸之路', '统计学原理', '企业组织理论与战略管理'],
            '专业知识课程': ['跨境电商', '营销渠道管理', '农业经济与电商发展', '供应链管理', '创新创业教育', '商务礼仪与商务谈判'],
            '工作技能课程': ['机器人商业企划与创', '企业经营模拟', '智能管理模拟', '经济学', '消费者行为学', '管理学原理', '销售管理', '市场营销学', '营销策划与经典案例', '数字营销', '新产品开发与品牌管理', '客户关系管理', '广告策划与管理', '营销前沿专题'],
        }
    },
    '23dzsw': {
        '专业名称': '23电子商务',
        '专业代码': '23dzsw',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 10.0, '专业知识课程': 10.0, '工作技能课程': 3.0},
        '选修课列表': {
            '学科基础课程': ['会计学', '海洋经济与海上丝绸之路', '财务管理', '企业组织理论与战略管理'],
            '专业知识课程': ['跨境电商', '供应链管理', '电子商务安全技术', '营销渠道管理'],
            '工作技能课程': ['机器人商业企划与', '企业经营模拟', '智能管理模拟', '经济学', '电子商务导论', '管理学原理', '电子商务服务', '数字营销', '电子商务发展前沿', '消费者行为学', '电子商务系统分析与设计', '营销数据分析与挖掘', '网络金融', '电子商务物流', '跨境电商', '商务智能与决策'],
        }
    },
    '23lygl': {
        '专业名称': '23旅游管理',
        '专业代码': '23lygl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 7.0, '专业知识课程': 12.0, '工作技能课程': 6.0},
        '选修课列表': {
            '学科基础课程': ['文化创意与旅游策划'],
            '专业知识课程': ['旅游管理综合实习', '旅游认知实习', '旅游研究方法与技术', '创新创业教育', '毕业论文', '工商管理特色实践1', '工商管理特色实践2', '工商管理特色实践3', '工商管理特色实践4', '公共关系与礼仪', '茶艺', '旅游大数据与智慧旅游', '酒水知识与服务', '旅游电子商务', '专业社会实践导论', '企业经营模拟'],
            '工作技能课程': ['机器人商业企划与创新实践', '公共关系与礼仪', '茶艺', '旅游大数据与智慧旅游', '旅游电子商务', '企业经营模拟'],
        }
    },
    '23hjkx': {
        '专业名称': '23环境科学',
        '专业代码': '23hjkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': ['环境生物学▲', '环境纳米材料▲', '化学生态学▲', '生物海洋学▲', '生态毒理学▲', '恢复生态学▲', '环境微生物学实验', '环境类专业认识实习 1.5', '环境地学实习', '仪器分析实验', '环境监测', '环境监测实验', '海洋环境调查实习', '环境化学实验', '环境评价课程设计', '毕业设计 / 论文', '创新创业教育', '流体力学实验●', '物理化学实验▲', '生物化学实验▲', '海洋生物学实验▲', '环境生物学实验▲', '海水分析实验▲', '环境微生物学', '环境工程学', '环境地学', '环境海洋学', '环境管理学', '环境化学', '基础生态学', '环境评价', '海洋生物学'],
        }
    },
    '23hjgc': {
        '专业名称': '23环境工程',
        '专业代码': '23hjgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 20.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['地质灾害防控前沿讲座', '地基基础与灾害防治', '地基基础与灾害防治实', '岩土工程有限元分析上'],
            '工作技能课程': ['环境微生物学', '环境监测', '固体废物处理与处置', '水污染控制工程', '环境地质学', '环境工程原理', '环境影响评价', '环境规划与管理', '环境海洋学'],
        }
    },
    '23tmgc': {
        '专业名称': '23土木工程',
        '专业代码': '23tmgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['计算机辅助绘图实', '电工学'],
            '专业知识课程': ['组合结构', '地下建筑与规划', '地下工程监测与', '工程水文学', '海岸动力学'],
            '工作技能课程': ['土木工程综合实', '材料力学', '房屋建筑学', '结构力学', '基础工程', '混凝土结构基本原理', '土木工程施工', '钢结构基本原理', '房屋结构', '结构抗震', '高层建筑结构', '钢结构设计'],
        }
    },
    '23gcgl': {
        '专业名称': '23工程管理',
        '专业代码': '23gcgl',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 4.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['土木工程概论', '工程制图实践', '工程测量', '测量实习', '材料力学', '土木工程材料实验', '管理学原理', '结构力学', '土力学实验', '*建设法规'],
            '专业知识课程': ['工程财务管理', '国际工程管理概论'],
            '工作技能课程': ['BIM技术原理及其', '工程造价软件应用'],
        }
    },
    '23gkhd': {
        '专业名称': '23港口航道与海岸工程',
        '专业代码': '23gkhd',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 2.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['疏浚技术'],
            '专业知识课程': [],
            '工作技能课程': [],
        }
    },
    '23cb': {
        '专业名称': '23船舶与海洋工程',
        '专业代码': '23cb',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 4.0, '工作技能课程': 2.0},
        '选修课列表': {
            '学科基础课程': ['船舶与海洋工程经济学', '海洋工程水动力学'],
            '专业知识课程': ['海洋工程结构疲劳与断裂', '海洋可再生能源利用技术'],
            '工作技能课程': ['海洋工程结构测试综合', '海洋工程结构智能建造与'],
        }
    },
    '23jxsj': {
        '专业名称': '23机械设计制造及自动化',
        '专业代码': '23jxsj',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 2.0, '专业知识课程': 4.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['海洋可再生能源'],
            '专业知识课程': ['产品造型', '工业企业管理', '沟通与工程写'],
            '工作技能课程': [],
        }
    },
    '23gysj': {
        '专业名称': '23工业设计',
        '专业代码': '23gysj',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 14.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['工业设计概论', '设计素描', '设计基础Ⅰ', '设计基础Ⅱ', '工程力学', '设计表达Ⅰ', '设计表达Ⅱ'],
            '专业知识课程': ['工业设计学科前沿', '绿色创新设计', '产品摄影'],
            '工作技能课程': ['写生', '工业设计工程基础', '模型制作', '产品开发设计实践', '毕业实习', '毕业设计'],
        }
    },
    '23zdh': {
        '专业名称': '23自动化',
        '专业代码': '23zdh',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 6.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['工程制图', '数据结构', '数字逻辑与', '传感器与检测技术', '传感器与检测技术实', '自动控制原理', '自动控制原理实验', '电力电子技术', '电机与拖动基础', '电力拖动控制系统', '自动化仪表与过程控', '现代控制理论基础', '最优化理论与方法', '训 —— 工 业 自 动 化 方', '计算机控制技术', '机器人技术基础', '工业控制网络技术', '系统辨识'],
            '专业知识课程': ['机器人技术基础', '系统辨识'],
            '工作技能课程': ['机器学习', '可编程控制器', '数字图像处理与'],
        }
    },
    '23lj': {
        '专业名称': '23轮机工程',
        '专业代码': '23lj',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 3.0, '专业知识课程': 3.5, '工作技能课程': 1.0},
        '选修课列表': {
            '学科基础课程': ['海洋机电装备技术学', '工程测试技术', '船舶原理与防污染', '船舶柴油机', '船舶辅助机械', '船舶电气设备及系统', '船舶动力装置', '轮机自动化', '轮机英语', '工程材料及机械制造', '工业企业管理', '金工实习', '生产实习', '船舶辅助机械实验', '轮机拆装实践', '内燃机原理实验', '船舶动力装置课程', '创新创业教育'],
            '专业知识课程': ['海洋工程装备技术', '振动噪声控制基础'],
            '工作技能课程': ['沟通与工程写作', '理论力学', '船舶辅助机械', '工程热力学', '船舶电气设备及系统', '工程流体力学', '船舶动力装置', '船舶柴油机', '轮机自动化', '材料力学', '机械原理', '机械设计', '传热学', '电工电子学'],
        }
    },
    '23yx': {
        '专业名称': '23药学',
        '专业代码': '23yx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 5.0, '专业知识课程': 5.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['糖化学生物学', '药用海洋生物'],
            '专业知识课程': ['药学导论', '* 天然药物化学', '* 药物化学', '海洋药物学', '* 药理学', '* 药剂学', '药剂学实验', '* 药物分析', '药学综合设计实验', '药物合成反应', '生药学', '临床药学导论', '机器学习与医药工', '药物设计学', '海洋药物前沿讲座'],
            '工作技能课程': ['生物技术制药', '药学英语', '潜水与海底生物调', '化学制药工艺学', '药物化学', '天然药物化学', '药理学', '生物化学', '药物分析', '微生物学', '药剂学', '药事管理', '海洋药物学', '糖药物学'],
        }
    },
    '23spkxgc': {
        '专业名称': '23食品科学与工程',
        '专业代码': '23spkxgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 7.0, '工作技能课程': 1.0},
        '选修课列表': {
            '学科基础课程': ['细胞生物学', '跨学科基础核心课'],
            '专业知识课程': ['海藻利用化学', '食品营销学', '基因工程'],
            '工作技能课程': ['文献检索与科技论文', '生物化学', '食品营养学', '微生物学', '食品安全与法规', '食品化学', '食品检验分析', '食品工程原理', '食品工厂设计', '食品保藏与加工工艺学', '水产食品学'],
        }
    },
    '23hyzykf': {
        '专业名称': '23海洋资源开发技术',
        '专业代码': '23hyzykf',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 5.0, '工作技能课程': 1.0},
        '选修课列表': {
            '学科基础课程': ['现代仪器分析', '跨学科基础核心课'],
            '专业知识课程': ['海洋功能食品', '海洋生物资源评估', '海洋功能因子检测技术', '药用海洋生物'],
            '工作技能课程': ['计算机绘图', '文献检索与科技论文', '化工原理', '海洋生物资源原料学', '生物化学', '海洋生物资源精深加工技术', '微生物学', '海洋生物资源产品质量控制', '水产资源利用化学', '海洋生物资源转化工程', '海洋生物资源开发前沿讲座'],
        }
    },
    '23scyz': {
        '专业名称': '23水产养殖学',
        '专业代码': '23scyz',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 4.0, '工作技能课程': 1.0},
        '选修课列表': {
            '学科基础课程': ['植物生理学实验', '海洋学实习', '生物实验技术实验', '生物信息学'],
            '专业知识课程': ['*甲壳动物增养殖学', '水产动物病害学实验', '观赏水族与休闲渔业概论', '水产养殖设施', '藻类与藻类栽培', '水产品安全与质量管理', '增殖工程与海洋牧场'],
            '工作技能课程': ['水产养殖生产实习', '毕业论文', '创新创业教育', '水产养殖科技讲座', '普通动物学', '鱼类增养殖学', '普通生态学', '贝类增养殖学', '养殖水环境化学', '甲壳动物增养殖学', '鱼类学', '水产动物营养与饲料学', '动物遗传育种学', '水产动物病害学', '生物饵料培养', '藻类与藻类栽培'],
        }
    },
    '23hyzyhj': {
        '专业名称': '23海洋资源与环境',
        '专业代码': '23hyzyhj',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 4.0, '工作技能课程': 1.0},
        '选修课列表': {
            '学科基础课程': ['微生物学实验', '组织胚胎学实验', '基础分子生物学'],
            '专业知识课程': ['海洋与渔业法规', '增殖工程与海洋牧场', '极地与远洋渔业科学'],
            '工作技能课程': ['渔政管理与渔港监督', '普通动物学', '渔业资源生物学', '鱼类学', '海洋生物资源与环境调查技术', '水生生物学', '生物资源评估', '普通生态学', '增殖资源学', '海洋环境生态学', '渔业海洋学导论', '渔业经济与管理', '海洋渔业环境导论', '保护生物学', '海洋与渔业法规'],
        }
    },
    '23hyyy': {
        '专业名称': '23海洋渔业科学与技术',
        '专业代码': '23hyyy',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 6.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['数字电子技术基础', '养殖土木工程学', '鱼类行为学', '水环境化学实验'],
            '专业知识课程': ['海洋学实习', '创新创业教育', '渔政管理与渔港监', '普通动物学', '增殖工程与海洋牧场', '渔业资源生物学', '养殖水环境工程学'],
            '工作技能课程': [],
        }
    },
    '23swkx': {
        '专业名称': '23生物科学',
        '专业代码': '23swkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 9.0, '工作技能课程': 2.5},
        '选修课列表': {
            '学科基础课程': ['植物生物学实习', '海洋生态学'],
            '专业知识课程': ['病毒学', '海洋生物功能材料', '表观遗传学', '微生物生理学', '蛋白质化学与蛋白质'],
            '工作技能课程': ['药用海洋生物', '生物检测技术与仪器', '绿色生物制造'],
        }
    },
    '23swjs': {
        '专业名称': '23生物技术',
        '专业代码': '23swjs',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 11.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['海洋生物学及海洋'],
            '专业知识课程': ['蛋白质化学与蛋白', '药用海洋生物'],
            '工作技能课程': ['计算生物学', '干细胞技术与应用', '绿色生物制造', '生物化学', '遗传学', '植物生物学', '细胞生物学', '动物生物学', '分子生物学', '微生物学', '生物技术', '普通生物学实验', '生物技术大实验', '生物化学与分子生物学实验'],
        }
    },
    '23stx': {
        '专业名称': '23生态学',
        '专业代码': '23stx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 7.5, '工作技能课程': 2.0},
        '选修课列表': {
            '学科基础课程': ['细胞生物学', '细胞与遗传实验Ⅰ', '动物生理学', '遗传学', '细胞与遗传实验Ⅱ'],
            '专业知识课程': ['*海洋生物学', '*污染生态毒理学', '污染生态毒理学实验', '*海洋生态学', '环境监测与环境影响', '环境科学概论', '生物地理学', '生命科学前沿与交叉', '海洋生态学实验', '海洋微生物学', '海洋微生物学实验', '城市生态学', '湿地生态学', '生态工程', '分子生态学', '海洋微型生物生态学', '海洋病毒学', '化学生态学', '生物地球化学循环'],
            '工作技能课程': ['生态规划与设计', '地理信息系统', '植物生物学', '生物化学', '动物生物学', '分子生物学', '微生物学', '生态学', '普通生物学实验', '污染生态毒理学实验', '生物化学与分子生物学实验', '环境监测与环境影响评价', '污染生态毒理学', '环境监测与环境影响评价实验'],
        }
    },
    '23hx': {
        '专业名称': '23化学',
        '专业代码': '23hx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 13.5, '工作技能课程': 6.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['地球化学基础', '化工原理 II', '化工原理实验 II', '生态学基础'],
            '工作技能课程': ['海洋腐蚀与防护技术', '计算机在化学中的'],
        }
    },
    '23hxgc': {
        '专业名称': '23化学工程与工艺',
        '专业代码': '23hxgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 6.0, '工作技能课程': 6.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['海洋腐蚀与防护技', '可再生能源工程', '仪器分析 Ⅱ'],
            '工作技能课程': ['化工节能技术', '催化原理'],
        }
    },
    '23jsjkxzw': {
        '专业名称': '23计算机(中外合作)',
        '专业代码': '23jsjkxzw',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 2.5, '专业知识课程': 5.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['Human Robot Interaction', 'Biologically Inspired'],
            '专业知识课程': ['Advanced Software', 'Embedded Software'],
            '工作技能课程': [],
        }
    },
    '23jsjkx': {
        '专业名称': '23计算机科学与技术',
        '专业代码': '23jsjkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 2.5, '专业知识课程': 4.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': ['并行与分布式计算', '信号与系统'],
            '专业知识课程': ['信息内容安全', '智能计算系统', '海洋大数据分析', '信息系统安全工程'],
            '工作技能课程': ['软件系统分析与设计', 'Web框架编程', '物联网系统设计与开发', '游戏设计与开发'],
        }
    },
    '23znkx': {
        '专业名称': '23智能科学与技术',
        '专业代码': '23znkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 5.0, '专业知识课程': 5.0, '工作技能课程': 2.5},
        '选修课列表': {
            '学科基础课程': ['软件工程理论基础', '并行与分布式计算', '信号与系统'],
            '专业知识课程': ['数据分析与数据挖掘', '大数据隐私保护技术'],
            '工作技能课程': ['Web框架编程', '项目管理', '计算机组网技术'],
        }
    },
    '23sjkx': {
        '专业名称': '23数据科学与大数据',
        '专业代码': '23sjkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 5.0, '专业知识课程': 5.0, '工作技能课程': 3.0},
        '选修课列表': {
            '学科基础课程': ['软件工程理论基础', '运筹学基础及应用', '最优化理论与方法'],
            '专业知识课程': ['海洋大数据分析', '大数据隐私保护技术'],
            '工作技能课程': ['Web框架编程', '项目管理', '计算机组网技术'],
        }
    },
    '23wdz': {
        '专业名称': '23微电子科学与工程',
        '专业代码': '23wdz',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['射频集成电路基础', '新型微纳传感技术概论'],
            '工作技能课程': ['集成电路与微系统封装技', '微电子技术前沿'],
        }
    },
    '23wlkjan': {
        '专业名称': '23网络空间安全',
        '专业代码': '23wlkjan',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 2.5, '专业知识课程': 5.0, '工作技能课程': 2.5},
        '选修课列表': {
            '学科基础课程': ['计算机图形学', '运筹学基础及应用'],
            '专业知识课程': ['智能计算系统', '人工智能安全', '*保密技术检查'],
            '工作技能课程': ['Web框架编程', '项目管理', '游戏设计与开发'],
        }
    },
    '23bmjs': {
        '专业名称': '23保密技术',
        '专业代码': '23bmjs',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 5.0, '专业知识课程': 5.0, '工作技能课程': 2.5},
        '选修课列表': {
            '学科基础课程': ['信号与系统'],
            '专业知识课程': ['智能计算系统', '数据分析与数据挖掘', '人工智能安全'],
            '工作技能课程': ['计算机组网技术'],
        }
    },
    '23rjgc': {
        '专业名称': '23软件工程',
        '专业代码': '23rjgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 2.5, '专业知识课程': 4.0, '工作技能课程': 2.5},
        '选修课列表': {
            '学科基础课程': ['数字逻辑'],
            '专业知识课程': ['系统安全技术', '信息系统安全工程', '大数据隐私保护技术'],
            '工作技能课程': ['Web框架编程', '游戏设计与开发', '项目管理'],
        }
    },
    '23wlx': {
        '专业名称': '23物理学',
        '专业代码': '23wlx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 3.0, '专业知识课程': 10.0, '工作技能课程': 9.5},
        '选修课列表': {
            '学科基础课程': ['微机技术及应用', '微机技术及应用实验'],
            '专业知识课程': ['流体力学', '凝聚态物理'],
            '工作技能课程': ['光电显示技术', '专业认知实习', '光学系统设计', 'FPGA 数字系统设计', '机械设计基础', '科研训练'],
        }
    },
    '23hyjs': {
        '专业名称': '23海洋技术',
        '专业代码': '23hyjs',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': ['开放实验Ⅰ', '开放实验Ⅱ', '海洋学', '信号与系统', '声学基础实验', '水声专业实验', '声学基础', '电磁场与电磁波', '通信技术基础', '海洋光学导论', '海洋光电探测实验', '海洋光学专业实验', '传感器技术与海洋应用', '遥感概论', '海洋遥感', '海洋地理信息系统', '海洋地理信息系统专业实验', '海洋遥感专业实验'],
        }
    },
    '23gdxx': {
        '专业名称': '23光电信息科学与工程',
        '专业代码': '23gdxx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 6.0, '专业知识课程': 6.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': ['电动力学', '微机技术及应用实验', '量子力学'],
            '专业知识课程': ['固体物理', '光电检测技术课程设计', '光谱学', '先进光学制造', '高分辨率光谱分析'],
            '工作技能课程': ['电子电工实训', '光机结构设计', '生产实习', '科研训练'],
        }
    },
    '23dzxxkx': {
        '专业名称': '23电子信息科学与技术',
        '专业代码': '23dzxxkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': ['电子技能实训—', '电路分析基础', '信号与系统'],
        }
    },
    '23dzxxgc': {
        '专业名称': '23电子信息工程',
        '专业代码': '23dzxxgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 3.0, '专业知识课程': 13.0, '工作技能课程': 2.0},
        '选修课列表': {
            '学科基础课程': ['自动控制原理'],
            '专业知识课程': ['数字图像处理', '光纤通信'],
            '工作技能课程': ['电子技能实训 -', '电路分析基础', '信号与系统'],
        }
    },
    '23txgc': {
        '专业名称': '23通信工程',
        '专业代码': '23txgc',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 0.0, '工作技能课程': 0.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': [],
            '工作技能课程': ['电子技能实训—', '电路分析基础', '电磁场与电磁波', '通信原理', '信号与系统'],
        }
    },
    '23hykxzw': {
        '专业名称': '23海洋科学(中外合作)',
        '专业代码': '23hykxzw',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 6.0, '工作技能课程': 6.0},
        '选修课列表': {
            '学科基础课程': ['理论力学'],
            '专业知识课程': ['流体力学 II', '海洋 - 大气相互作用'],
            '工作技能课程': ['海洋前沿讲座 - 海洋环流', '海洋前沿讲座 - 海洋波动', '海洋前沿讲座 - 海洋与气候', 'Linux 基础', '海洋环境管理'],
        }
    },
    '23hykx': {
        '专业名称': '23海洋科学',
        '专业代码': '23hykx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 0.0, '专业知识课程': 12.0, '工作技能课程': 4.0},
        '选修课列表': {
            '学科基础课程': [],
            '专业知识课程': ['海洋 - 大气相', '海洋内波', '海洋环流'],
            '工作技能课程': ['气象统计方法', '海洋台站实习', '海洋前沿讲座 - 海洋', '海岸带综合管理', '工程环境海洋学', '海洋学', '海洋调查', '流体力学 I', '海洋调查仪器操作', '物理海洋学', '卫星海洋学', '海洋要素计算', '海洋环流', '海洋内波', '海浪', '潮汐学'],
        }
    },
    '23dqkx': {
        '专业名称': '23大气科学',
        '专业代码': '23dqkx',
        '有卓越班': False,
        '学分要求': {'学科基础课程': 4.0, '专业知识课程': 8.0, '工作技能课程': 2.0},
        '选修课列表': {
            '学科基础课程': ['Python 程序设计', '计算机网络'],
            '专业知识课程': ['风暴潮', '雷达气象学', '极地海洋学', '海雾'],
            '工作技能课程': ['全球气候变化与应对'],
        }
    },
}

DISPLAY_23 = [
    {'code': '23kg', 'name': '23勘工（有卓越班）', 'emoji': '📚', 'school': '海洋地球科学学院', 'year': '2023'},
    {'code': '23dz', 'name': '23地质（统一班级）', 'emoji': '🗺️', 'school': '海洋地球科学学院', 'year': '2023'},
    {'code': '23dx', 'name': '23地信（统一班级）', 'emoji': '🛰️', 'school': '海洋地球科学学院', 'year': '2023'},
    {'code': '23hykxbj', 'name': '23海洋科学(拔尖)', 'emoji': '⭐', 'school': '崇本学堂', 'year': '2023'},
    {'code': '23swkxbj', 'name': '23生物科学(拔尖)', 'emoji': '⭐', 'school': '崇本学堂', 'year': '2023'},
    {'code': '23swjshd', 'name': '23生物技术(海德)', 'emoji': '🏫', 'school': '海德学院', 'year': '2023'},
    {'code': '23spkxhd', 'name': '23食品科学(海德)', 'emoji': '🏫', 'school': '海德学院', 'year': '2023'},
    {'code': '23sxhd', 'name': '23数学(海德)', 'emoji': '🏫', 'school': '海德学院', 'year': '2023'},
    {'code': '23ydxl', 'name': '23运动训练', 'emoji': '🎓', 'school': '基础教育学院', 'year': '2023'},
    {'code': '23yybp', 'name': '23音乐表演', 'emoji': '🎓', 'school': '基础教育学院', 'year': '2023'},
    {'code': '23clkx', 'name': '23材料科学与工程', 'emoji': '🔧', 'school': '材料科学与工程学院', 'year': '2023'},
    {'code': '23gfz', 'name': '23高分子材料与工程', 'emoji': '🔧', 'school': '材料科学与工程学院', 'year': '2023'},
    {'code': '23sx', 'name': '23数学与应用数学', 'emoji': '📐', 'school': '数学科学学院', 'year': '2023'},
    {'code': '23xxjskx', 'name': '23信息与计算科学', 'emoji': '📐', 'school': '数学科学学院', 'year': '2023'},
    {'code': '23zzx', 'name': '23政治学与行政学', 'emoji': '🏛️', 'school': '国际事务与公共管理学院', 'year': '2023'},
    {'code': '23ggsy', 'name': '23公共事业管理', 'emoji': '🏛️', 'school': '国际事务与公共管理学院', 'year': '2023'},
    {'code': '23xzgl', 'name': '23行政管理', 'emoji': '🏛️', 'school': '国际事务与公共管理学院', 'year': '2023'},
    {'code': '23fx', 'name': '23法学', 'emoji': '⚖️', 'school': '法学院', 'year': '2023'},
    {'code': '23fxzw', 'name': '23法学(中外合作)', 'emoji': '⚖️', 'school': '法学院', 'year': '2023'},
    {'code': '23hywx', 'name': '23汉语言文学', 'emoji': '📝', 'school': '文学与新闻传播学院', 'year': '2023'},
    {'code': '23whcygl', 'name': '23文化产业管理', 'emoji': '📝', 'school': '文学与新闻传播学院', 'year': '2023'},
    {'code': '23xwx', 'name': '23新闻学', 'emoji': '📝', 'school': '文学与新闻传播学院', 'year': '2023'},
    {'code': '23wlxmt', 'name': '23网络与新媒体', 'emoji': '📝', 'school': '文学与新闻传播学院', 'year': '2023'},
    {'code': '23yy', 'name': '23英语', 'emoji': '🌐', 'school': '外国语学院', 'year': '2023'},
    {'code': '23ry', 'name': '23日语', 'emoji': '🌐', 'school': '外国语学院', 'year': '2023'},
    {'code': '23cxy', 'name': '23朝鲜语', 'emoji': '🌐', 'school': '外国语学院', 'year': '2023'},
    {'code': '23fy', 'name': '23法语', 'emoji': '🌐', 'school': '外国语学院', 'year': '2023'},
    {'code': '23dey', 'name': '23德语', 'emoji': '🌐', 'school': '外国语学院', 'year': '2023'},
    {'code': '23jrx', 'name': '23金融学', 'emoji': '💹', 'school': '经济学院', 'year': '2023'},
    {'code': '23gjmy', 'name': '23国际经济与贸易', 'emoji': '💹', 'school': '经济学院', 'year': '2023'},
    {'code': '23wlgl', 'name': '23物流管理', 'emoji': '💹', 'school': '经济学院', 'year': '2023'},
    {'code': '23jjx', 'name': '23经济学', 'emoji': '💹', 'school': '经济学院', 'year': '2023'},
    {'code': '23gsgl', 'name': '23工商管理', 'emoji': '📊', 'school': '管理学院', 'year': '2023'},
    {'code': '23kuaiji', 'name': '23会计学', 'emoji': '📊', 'school': '管理学院', 'year': '2023'},
    {'code': '23kuaijiACCA', 'name': '23会计学(ACCA)', 'emoji': '💼', 'school': '管理学院', 'year': '2023'},
    {'code': '23cwgl', 'name': '23财务管理', 'emoji': '📊', 'school': '管理学院', 'year': '2023'},
    {'code': '23scyx', 'name': '23市场营销', 'emoji': '📊', 'school': '管理学院', 'year': '2023'},
    {'code': '23dzsw', 'name': '23电子商务', 'emoji': '📊', 'school': '管理学院', 'year': '2023'},
    {'code': '23lygl', 'name': '23旅游管理', 'emoji': '📊', 'school': '管理学院', 'year': '2023'},
    {'code': '23hjkx', 'name': '23环境科学', 'emoji': '🌿', 'school': '环境科学与工程学院', 'year': '2023'},
    {'code': '23hjgc', 'name': '23环境工程', 'emoji': '🌿', 'school': '环境科学与工程学院', 'year': '2023'},
    {'code': '23tmgc', 'name': '23土木工程', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23gcgl', 'name': '23工程管理', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23gkhd', 'name': '23港口航道与海岸工程', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23cb', 'name': '23船舶与海洋工程', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23jxsj', 'name': '23机械设计制造及自动化', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23gysj', 'name': '23工业设计', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23zdh', 'name': '23自动化', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23lj', 'name': '23轮机工程', 'emoji': '⚙️', 'school': '工程学院', 'year': '2023'},
    {'code': '23yx', 'name': '23药学', 'emoji': '💊', 'school': '医药学院', 'year': '2023'},
    {'code': '23spkxgc', 'name': '23食品科学与工程', 'emoji': '🍽️', 'school': '食品科学与工程学院', 'year': '2023'},
    {'code': '23hyzykf', 'name': '23海洋资源开发技术', 'emoji': '🍽️', 'school': '食品科学与工程学院', 'year': '2023'},
    {'code': '23scyz', 'name': '23水产养殖学', 'emoji': '🐟', 'school': '水产学院', 'year': '2023'},
    {'code': '23hyzyhj', 'name': '23海洋资源与环境', 'emoji': '🐟', 'school': '水产学院', 'year': '2023'},
    {'code': '23hyyy', 'name': '23海洋渔业科学与技术', 'emoji': '🐟', 'school': '水产学院', 'year': '2023'},
    {'code': '23swkx', 'name': '23生物科学', 'emoji': '🔬', 'school': '生命科学学院', 'year': '2023'},
    {'code': '23swjs', 'name': '23生物技术', 'emoji': '🔬', 'school': '生命科学学院', 'year': '2023'},
    {'code': '23stx', 'name': '23生态学', 'emoji': '🔬', 'school': '生命科学学院', 'year': '2023'},
    {'code': '23hx', 'name': '23化学', 'emoji': '⚗️', 'school': '化学化工学院', 'year': '2023'},
    {'code': '23hxgc', 'name': '23化学工程与工艺', 'emoji': '⚗️', 'school': '化学化工学院', 'year': '2023'},
    {'code': '23jsjkxzw', 'name': '23计算机(中外合作)', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23jsjkx', 'name': '23计算机科学与技术', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23znkx', 'name': '23智能科学与技术', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23sjkx', 'name': '23数据科学与大数据', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23wdz', 'name': '23微电子科学与工程', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23wlkjan', 'name': '23网络空间安全', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23bmjs', 'name': '23保密技术', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23rjgc', 'name': '23软件工程', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23wlx', 'name': '23物理学', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23hyjs', 'name': '23海洋技术', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23gdxx', 'name': '23光电信息科学与工程', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23dzxxkx', 'name': '23电子信息科学与技术', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23dzxxgc', 'name': '23电子信息工程', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23txgc', 'name': '23通信工程', 'emoji': '💻', 'school': '信息科学与工程学部', 'year': '2023'},
    {'code': '23hykxzw', 'name': '23海洋科学(中外合作)', 'emoji': '🌊', 'school': '海洋与大气学院', 'year': '2023'},
    {'code': '23hykx', 'name': '23海洋科学', 'emoji': '🌊', 'school': '海洋与大气学院', 'year': '2023'},
    {'code': '23dqkx', 'name': '23大气科学', 'emoji': '🌊', 'school': '海洋与大气学院', 'year': '2023'},
]
